uhnp/src/DataProcessors/АнализЗаполненияПоказателей/АнализЗаполненияПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АнализЗаполненияПоказателей</name>
  <attributes>
    <name>ВидГруппаОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкземплярОтчета</name>
    <type>
      <types>DocumentRef.НастраиваемыйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоВыполнений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьМакетыСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДляСохраненияОтчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СравнениеСКлассическимАлгоритмомРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей/ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей</name>
  <resources>
    <name>ЭталонныйМакет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремяЗаполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Рассчитывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РассчитыватьКлассическимАлгоритмомРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ЭкземплярОтчета</name>
    <type>
      <types>DocumentRef.НастраиваемыйОтчет</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Documents/НастраиваемыйОтчет/НастраиваемыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НастраиваемыйОтчет</name>
  <basedOn>Catalog.БланкиОтчетов</basedOn>
  <basedOn>Catalog.ВидыОтчетов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВывода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОтчета</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечанияБланков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтображения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыКонтекстногоОбновленияЗависимыхЯчеек</name>
    <type>
      <types>EnumRef.ПараметрыКонтекстногоОбновленияЗависимыхЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлИмпорта</name>
    <type>
      <types>CatalogRef.ХранимыеФайлыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеПериодом</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончания</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияОтчета</name>
    <type>
      <types>EnumRef.СпособыФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоПроверки</name>
    <type>
      <types>CatalogRef.ПравилаПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкИмпорта</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСвертывания</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтениеНеактуальныхЗаписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВноситьИзменения</name>
    <comment>Не вносить изменения в отчет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Состояние</name>
    <type>
      <types>EnumRef.СостоянияОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеВалюты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭкземплярыИсточники</name>
    <attributes>
      <name>ЭкземплярОтчета</name>
      <type>
        <types>DocumentRef.НастраиваемыйОтчет</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/DataProcessors/АнализЗаполненияПоказателей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	
	
// Функция - Выполнить авто заполнение
// Выполняет последовательный расчет документов сначала классическим, а затем расширенным алгоритмом пересчета показателей
// 
// Возвращаемое значение:
//	Структура - Структура с результатами расчета 
//
Функция ВыполнитьАвтоЗаполнение() Экспорт
	
	Если Не ЗначениеЗаполнено(ВидГруппаОтчета) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеТиповЧисло 	= ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(10,0,ДопустимыйЗнак.Неотрицательный);
	ОписаниеТиповБулево = ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево();
	
	ТзРезультатВыполнения = Новый ТаблицаЗначений;
	ТзРезультатВыполнения.Колонки.Добавить("Результат", ОписаниеТиповБулево);
	ТзРезультатВыполнения.Колонки.Добавить("РезультатКлассическийДвижок", ОписаниеТиповБулево);
	ТзРезультатВыполнения.Колонки.Добавить("РезультатСравненияЭталон", ОписаниеТиповБулево);
	ТзРезультатВыполнения.Колонки.Добавить("РезультатСравненияКлассическийДвижок", ОписаниеТиповБулево);
	ТзРезультатВыполнения.Колонки.Добавить("ВидОтчета");
	ТзРезультатВыполнения.Колонки.Добавить("ПравилоОбработки");
	ТзРезультатВыполнения.Колонки.Добавить("ЭкземплярОтчета");
	ТзРезультатВыполнения.Колонки.Добавить("МакетЭталон");
	ТзРезультатВыполнения.Колонки.Добавить("Макет");
	ТзРезультатВыполнения.Колонки.Добавить("МакетКлассическийДвижок");
	ТзРезультатВыполнения.Колонки.Добавить("ВремяЗаполнения", ОписаниеТиповЧисло);
	ТзРезультатВыполнения.Колонки.Добавить("ЦелевоеВремяЗаполнения", ОписаниеТиповЧисло);
	ТзРезультатВыполнения.Колонки.Добавить("ВремяЗаполненияКлассическийДвижок", ОписаниеТиповЧисло);
	ТзРезультатВыполнения.Колонки.Добавить("ВремяРасчетаПараметрики", ОписаниеТиповЧисло);
	ТзРезультатВыполнения.Колонки.Добавить("ВремяРасчетаПараметрикиКлассическийДвижок", ОписаниеТиповЧисло);
	ТзРезультатВыполнения.Колонки.Добавить("ВремяЗаписи", ОписаниеТиповЧисло);
	ТзРезультатВыполнения.Колонки.Добавить("ВремяЗаписиКлассическийДвижок", ОписаниеТиповЧисло);
	ТзРезультатВыполнения.Колонки.Добавить("ОписаниеОшибки");
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("БылиОшибки",Ложь);
	СтруктураРезультат.Вставить("Протокол");
	
	ОбработкаРасчета = Обработки.РасчетИЗаписьПоказателей.Создать();
	
	// Запомним старое значение константы
	Попытка
		РежимТрассировкиИзначальный	= Константы.ИспользоватьРежимТрассировкиПересчетаПоказателей.Получить();
		Константы.ИспользоватьРежимТрассировкиПересчетаПоказателей.Установить(Ложь);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось выполнить процедуру вычисления, по причине: %1'"),ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		СтруктураРезультат.БылиОшибки = Истина;
		Возврат СтруктураРезультат; 
	КонецПопытки;
	
	// Если на входе группа - последовательно тестируем все отчеты в группе, упорядоченные по наименованию.
	МассивОбрабатываемыхОтчетов = Новый Массив;
	Если ВидГруппаОтчета.ЭтоГруппа Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОтчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыОтчетов КАК ВидыОтчетов
		|ГДЕ
		|	ВидыОтчетов.ПометкаУдаления = ЛОЖЬ
		|	И ВидыОтчетов.Родитель В ИЕРАРХИИ(&Родитель)
		|	И ВидыОтчетов.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыОтчетов.Родитель.Код,
		|	ВидыОтчетов.Код";
		
		Запрос.УстановитьПараметр("Родитель",ВидГруппаОтчета);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивОбрабатываемыхОтчетов.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	Иначе
		МассивОбрабатываемыхОтчетов.Добавить(ВидГруппаОтчета);
	КонецЕсли;
	
	// По выбранным видам отчетов:
	Для СчДвижок = 1 По ?(СравнениеСКлассическимАлгоритмомРасчета, 2, 1) Цикл
		
		Для Каждого ВидОтчета Из МассивОбрабатываемыхОтчетов Цикл
			
			// Ищем экземпляры 
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	НастраиваемыйОтчет.Ссылка КАК Ссылка,
				|	ЕСТЬNULL(ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей.ЭталонныйМакет, НЕОПРЕДЕЛЕНО) КАК ЭталонныйМакет,
				|	ЕСТЬNULL(ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей.ЦелевоеВремяЗаполнения, 0) КАК ЦелевоеВремяЗаполнения,
				|	ЕСТЬNULL(ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей.Рассчитывать, ИСТИНА) КАК Рассчитывать,
				|	ЕСТЬNULL(ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей.РассчитыватьКлассическимАлгоритмомРасчета, ИСТИНА) КАК РассчитыватьКлассическимАлгоритмомРасчета
				|ИЗ
				|	Документ.НастраиваемыйОтчет КАК НастраиваемыйОтчет
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей КАК ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей
				|		ПО (ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей.ЭкземплярОтчета = НастраиваемыйОтчет.Ссылка)
				|ГДЕ
				|	НастраиваемыйОтчет.ВидОтчета = &ВидОтчета
				|	И НЕ НастраиваемыйОтчет.ПометкаУдаления
				|	И &ДополнительныйОтбор
				|
				|УПОРЯДОЧИТЬ ПО
				|	НАЧАЛОПЕРИОДА(НастраиваемыйОтчет.ПериодОтчета.ДатаНачала, ГОД),
				|	НастраиваемыйОтчет.ПериодОтчета.Периодичность.Порядок,
				|	НастраиваемыйОтчет.ПериодОтчета.ДатаНачала,
				|	НастраиваемыйОтчет.Организация.Родитель.Код УБЫВ,
				|	НастраиваемыйОтчет.Номер";
		
			Если ЗначениеЗаполнено(ЭкземплярОтчета) Тогда  
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДополнительныйОтбор","&ДополнительныйОтбор
				|	И НастраиваемыйОтчет.Ссылка = &Ссылка");
				Запрос.УстановитьПараметр("Ссылка",ЭкземплярОтчета);
			КонецЕсли;
			
			Если НЕ СравнениеСКлассическимАлгоритмомРасчета Тогда
				// Только сравнение с эталоном
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДополнительныйОтбор","&ДополнительныйОтбор
				|	И НЕ ХранилищаЭталонныхМакетовТестированияПересчетаПоказателей.ЭталонныйМакет ЕСТЬ NULL");
			КонецЕсли;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДополнительныйОтбор","ИСТИНА");
			
			Запрос.УстановитьПараметр("ВидОтчета",ВидОтчета);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				
				Если СчДвижок=2 И НЕ Выборка.РассчитыватьКлассическимАлгоритмомРасчета Тогда
					Продолжить;
				КонецЕсли;
				
				// Подготовим объект расчета
				тЭкземплярОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектРасчета = тЭкземплярОбъект.ПодготовитьСтруктуруПеременныхДляРасчета();
				ОбъектРасчета.ИдентификаторСеанса = Строка(Новый УникальныйИдентификатор);
				ОбъектРасчета.Вставить("ПравилоОбработки", Документы.НастраиваемыйОтчет.ЗначениеНастройкиОбработкиДокумента(ОбъектРасчета, "ПравилоОбработки"));
				
				Если Выборка.Рассчитывать Тогда
				
					Если СчДвижок = 1 Тогда
						
						нСтр							= ТзРезультатВыполнения.Добавить();
						нСтр.ВидОтчета					= ВидОтчета;
						нСтр.ЭкземплярОтчета			= Выборка.Ссылка;
						нСтр.ПравилоОбработки			= ОбъектРасчета.ПравилоОбработки;
						нСтр.ЦелевоеВремяЗаполнения 	= Выборка.ЦелевоеВремяЗаполнения;
				
						// Удаляем все предыдущие версии  
						УправлениеРасчетомПоказателей.ОчиститьСтарыеДанные(ОбъектРасчета,Истина,Истина,Истина);
						Попытка
							ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
							ОбработкаРасчета.ПараметрическаяНастройка("ДляПравилаРасчета", ОбъектРасчета.ПравилоОбработки);
							ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
							нСтр.ВремяРасчетаПараметрики = ВремяОкончания - ВремяНачала;
						Исключение 
							
							ИнформацияОбОшибке = ИнформацияОбОшибке();
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ошибка подготовки параметрики. Текст ошибки: %1'"),ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
							
							нСтр.ОписаниеОшибки         = ТекстСообщения;
							нСтр.Результат              = Ложь;
							
							// Если параметрика не рассчиталась, дальнейшие тесты по этому варианту делать не нужно
							СтруктураРезультат.БылиОшибки = Истина;
							Продолжить; 		
							
						КонецПопытки;
					Иначе
						нСтр = ТзРезультатВыполнения.Найти(Выборка.Ссылка,"ЭкземплярОтчета");
						УправлениеРасчетомПоказателей.ОчиститьСтарыеДанные(ОбъектРасчета,Истина,Ложь,Истина);
						ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
						УправлениеОтчетамиУХ.ПодготовитьДанныеПараметрическойНастройки(ОбъектРасчета);
						ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
						нСтр.ВремяРасчетаПараметрикиКлассическийДвижок = ВремяОкончания - ВремяНачала;
					КонецЕсли;
					
				Иначе
					
					нСтр 							= ТзРезультатВыполнения.Добавить();
					нСтр.ВидОтчета					= ВидОтчета;
					нСтр.ЭкземплярОтчета			= Выборка.Ссылка;
					нСтр.ПравилоОбработки			= ОбъектРасчета.ПравилоОбработки;
					
				КонецЕсли;
				
				Если Выборка.ЭталонныйМакет = Неопределено Тогда
					нСтр.МакетЭталон = Неопределено;
				Иначе
					нСтр.МакетЭталон = Выборка.ЭталонныйМакет.Получить();
				КонецЕсли;
				нСтр.РезультатСравненияКлассическийДвижок = Неопределено;
				нСтр.РезультатСравненияЭталон = Неопределено;
				
				Если Выборка.Рассчитывать Тогда
				
					Если СчДвижок = 1 Тогда
						
						// Заполняем по регламенту расширенным алгоритмом
						Для Сч = 1 По ЧислоВыполнений Цикл
								
							Попытка
								
								// Расчет
								ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();								
								ОбработкаРасчета.УникальныйИдентификаторСеанса = Новый УникальныйИдентификатор;
								ОбработкаРасчета.Регистратор = Выборка.Ссылка;
								ОбработкаРасчета.ИспользоватьЛогИзмененныхЗначенийПоказателейОтчетов = Истина;
								ДанныеДляПересчета = ОбработкаРасчета.ДанныеДляПересчетаПоказателей.Добавить();
								ЗаполнитьЗначенияСвойств(ДанныеДляПересчета, ОбъектРасчета);
								нСтр.Результат = ОбработкаРасчета.РассчитатьПоДаннымДляПересчета();
								ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
								Если Сч = 1 Тогда
									// Фиксируем время первого выполнения
									нСтр.ВремяЗаполнения = ВремяОкончания - ВремяНачала;
								КонецЕсли;
								
								// Запись
								Если нСтр.Результат Тогда
									ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
									нСтр.Результат = ОбработкаРасчета.ЗаписатьЛогИзмененныхПоказателей();
									ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
									Если Сч = 1 Тогда
										// Фиксируем время первой записи
										нСтр.ВремяЗаписи = ВремяОкончания - ВремяНачала;
									КонецЕсли;
								КонецЕсли;
								
								Если Не нСтр.Результат Тогда
									нСтр.ОписаниеОшибки = НСтр("ru = 'Ошибка расчета документа'");
									СтруктураРезультат.БылиОшибки = Истина;
								КонецЕсли;
								
							Исключение
								
								ИнформацияОбОшибке				= ИнформацияОбОшибке();
								нСтр.ОписаниеОшибки				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
								нСтр.Результат					= Ложь;
								СтруктураРезультат.БылиОшибки	= Истина;

							КонецПопытки;
							
							Если НЕ нСтр.Результат Тогда
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
						Если нСтр.Результат Тогда
							Попытка
								нСтр.Макет = ПолучитьТабДокПоЭкземпляру(ОбъектРасчета);
							Исключение							
								ИнформацияОбОшибке				= ИнформацияОбОшибке();
								нСтр.ОписаниеОшибки				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
								нСтр.Результат					= Ложь;
								СтруктураРезультат.БылиОшибки	= Истина;
							КонецПопытки;
						КонецЕсли;
						
					ИначеЕсли СчДвижок = 2 И Выборка.РассчитыватьКлассическимАлгоритмомРасчета Тогда
						// Заполняем по регламенту классическим способом
						
						Для Сч = 1 По ЧислоВыполнений Цикл
							
							Попытка
								
								// Расчет
								ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
								ОбработкаРасчетаКлассическая = Обработки.ЗаписьПоказателяСРасчетомЗависимых.Создать();
								ОбработкаРасчетаКлассическая.Регистратор = Выборка.Ссылка;
								МассивПериодов = ПериодыУХ.ПолучитьПодчиненныеПериоды(ОбъектРасчета.ПериодОтчета.ДатаНачала,ОбъектРасчета.ПериодОкончания.ДатаОкончания,ОбъектРасчета.ПериодОтчета.Периодичность);
								Для Каждого Период Из МассивПериодов Цикл
									ДанныеДляПересчета = ОбработкаРасчетаКлассическая.ДанныеДляПересчетаПоказателей.Добавить();
									ЗаполнитьЗначенияСвойств(ДанныеДляПересчета, ОбъектРасчета);
								  	ДанныеДляПересчета.ПериодОтчета = Период;
								КонецЦикла;
								ОбработкаРасчетаКлассическая.ИдентификаторСеанса = ОбъектРасчета.ИдентификаторСеанса;
								ОбработкаРасчетаКлассическая.РассчитатьЗначенияПоказателей();
								ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
								Если Сч = 1 Тогда
									// Фиксируем время первого выполнения
									нСтр.ВремяЗаполненияКлассическийДвижок = ВремяОкончания - ВремяНачала;
								КонецЕсли;
								
								// Запись
								ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
								ПараметрыЗадания = Новый Структура;		
								ПараметрыЗадания.Вставить("Валюта", 					ОбъектРасчета.ОсновнаяВалюта);
								ПараметрыЗадания.Вставить("Бланк", 						ОбъектРасчета.ШаблонОтчета);
								ПараметрыЗадания.Вставить("ПравилоОбработки", 			ОбъектРасчета.ПравилоОбработки);
								ПараметрыЗадания.Вставить("ИспользуемаяИБ", 			ОбъектРасчета.ИспользуемаяИБ);
								ПараметрыЗадания.Вставить("СпособФормированияОтчета", 	ОбъектРасчета.СпособФормированияОтчета);
								ПараметрыЗадания.Вставить("РежимТрассировки"			,Ложь);
								ПараметрыЗадания.Вставить("ТаблицаИсходныхПоказателей"	,Новый ТаблицаЗначений);
								ПараметрыЗадания.Вставить("ТаблицаТрассировкиРасчета"	,Новый ТаблицаЗначений);
								ПараметрыЗадания.Вставить("ЧерновойРежим"				,Ложь);
								ПараметрыЗадания.Вставить("ИдентификаторСеанса"			,ОбъектРасчета.ИдентификаторСеанса);
								ПараметрыЗадания.Вставить("ОчисткаДокумента"			,Ложь);
								ПараметрыЗадания.Вставить("РежимЭкземпляра"				,Истина);
								ПараметрыЗадания.Вставить("Регистратор"	,				ОбъектРасчета.Ссылка);
								ПараметрыЗадания.Вставить("ВидОтчета",					ОбъектРасчета.ВидОтчета);
								ПараметрыЗадания.Вставить("Сценарий",					ОбъектРасчета.Сценарий);
								ПараметрыЗадания.Вставить("ПериодОтчета",				ОбъектРасчета.ПериодОтчета);
								ПараметрыЗадания.Вставить("ПериодОкончания", 			ОбъектРасчета.ПериодОкончания);
								ПараметрыЗадания.Вставить("Организация",	 			ОбъектРасчета.Организация);
								ПараметрыЗадания.Вставить("Проект",	 					ОбъектРасчета.Проект);
								Для Инд = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
									ПараметрыЗадания.Вставить("Аналитика"+Инд, ОбъектРасчета["Аналитика"+Инд]);
								КонецЦикла;	
								//СводнаяТаблицаУХ.ПрименитьИзменения(ПараметрыЗадания,"","");
								ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
								Если Сч = 1 Тогда
									// Фиксируем время первой записи
									нСтр.ВремяЗаписиКлассическийДвижок = ВремяОкончания - ВремяНачала;
								КонецЕсли;
								
								нСтр.РезультатКлассическийДвижок = Истина;
								
							Исключение
								
								ИнформацияОбОшибке 					= ИнформацияОбОшибке();
								нСтр.ОписаниеОшибки					= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
								СтруктураРезультат.БылиОшибки 		= Истина;
							
							КонецПопытки;
							
							Если Не нСтр.РезультатКлассическийДвижок Тогда
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
						Если нСтр.РезультатКлассическийДвижок Тогда
							Попытка
								нСтр.МакетКлассическийДвижок = ПолучитьТабДокПоЭкземпляру(ОбъектРасчета);
							Исключение							
								ИнформацияОбОшибке				= ИнформацияОбОшибке();
								нСтр.ОписаниеОшибки				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
								нСтр.Результат					= Ложь;
								СтруктураРезультат.БылиОшибки	= Истина;
							КонецПопытки;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					Попытка
						нСтр.Макет = ПолучитьТабДокПоЭкземпляру(ОбъектРасчета);
						нСтр.Результат = Истина;
					Исключение
						ИнформацияОбОшибке = ИнформацияОбОшибке();
						нСтр.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
						нСтр.Результат = Ложь;
						СтруктураРезультат.БылиОшибки = Истина;
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла;
				
		КонецЦикла;
		
	КонецЦикла;
		
	// Вернем исходное значение констант
	Попытка
		Константы.ИспользоватьРежимТрассировкиПересчетаПоказателей.Установить(РежимТрассировкиИзначальный);		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось выполнить процедуру вычисления, по причине: %1'"),ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецПопытки;
	
	// Сформируем протокол результатов
	ПолучитьПротоколРезультатов(ТзРезультатВыполнения,СтруктураРезультат);
	
	Возврат СтруктураРезультат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТабДокПоЭкземпляру(ОбъектРасчета)
	
	ПолеТабличногоДокументаМакет = Новый ТабличныйДокумент;
	
	ОтчетАБ = Обработки.АналитическийБланк.Создать();
	ОтчетАБ.Бланк										= ОбъектРасчета.ШаблонОтчета;
	ОтчетАБ.Сценарий									= ОбъектРасчета.Сценарий;
	ОтчетАБ.ПериодОтчета								= ОбъектРасчета.ПериодОтчета;
	ОтчетАБ.ПериодОтчетаОкончание						= ОбъектРасчета.ПериодОкончания;
	ОтчетАБ.Организация 								= ОбъектРасчета.Организация;
	ОтчетАБ.Проект										= ОбъектРасчета.Проект;
	ОтчетАБ.Валюта										= ОбъектРасчета.ОсновнаяВалюта;
	ОтчетАБ.ЕдиницаИзмерения							= ОбъектРасчета.ЕдиницаИзмерения;
	ОтчетАБ.ТекущееПравило								= ОбъектРасчета.ПравилоОбработки;
	ОтчетАБ.ИдентификаторСеанса							= ОбъектРасчета.ИдентификаторСеанса;
	
	ДанныеВидаОтчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектРасчета.ВидОтчета, "ВидАналитики1,ВидАналитики2,ВидАналитики3,ВидАналитики4,ВидАналитики5,ВидАналитики6");
	Для Инд = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
	 	Если ЗначениеЗаполнено(ДанныеВидаОтчета["ВидАналитики"+Инд]) Тогда
			ОтчетАБ.ИспользоватьБыстрыйОтборПоАналитикамВерсии = Истина;
			ОтчетАБ["Аналитика"+Инд] = ОбъектРасчета["Аналитика"+Инд];
		КонецЕсли;
	КонецЦикла;
	
	ДополнительныеНастройки = Новый КомпоновщикНастроекКомпоновкиДанных;
	СтруктураПараметров		= Новый Структура;
	СтруктураПараметров.Вставить("ПолеТабличногоДокументаМакет",ПолеТабличногоДокументаМакет);
	СтруктураПараметров.Вставить("ОбновитьДанные",Истина);
	СтруктураПараметров.Вставить("ДополнительныеНастройки",ДополнительныеНастройки); 
	СтруктураПараметров.Вставить("ТекущаяТочность",ОбъектРасчета.УровеньТочности);
	СтруктураПараметров.Вставить("ТекущийДелитель",ОбъектРасчета.ЕдиницаИзмерения);
	СтруктураПараметров.Вставить("НомерОсновногоЯзыка",ОбъектРасчета.глОсновнойЯзык);
	
	ОтчетАБ.ПолучитьРезультирующийМакет(СтруктураПараметров);
	
	Возврат ПолеТабличногоДокументаМакет;
	
КонецФункции

Процедура ПолучитьПротоколРезультатов(ТзРезультатВыполнения,СтруктураРезультат)
	
	ТабДокПротокол  		= Новый ТабличныйДокумент;
	ТабДокОтличияВМакетах	= Новый ТабличныйДокумент;
	
	тМакет 					= ПолучитьМакет("ШаблонПротоколаТестирования");	
	Если СравнениеСКлассическимАлгоритмомРасчета Тогда
		ПрефиксОбласти = "_КА";
		ВремяОбщееКлассическийДвижок = 0;
		ВремяПараметрикаКлассическийДвижокИтого = 0;
		ВремяЗаполненияКлассическийДвижокИтого = 0;	
		ВремяЗаписиКлассическийДвижокИтого = 0;
		ВремяОбщееКлассическийДвижокИтого = 0;
		ВремяОбщееРасширенныйДвижокИтого = 0;
	Иначе
		ПрефиксОбласти = "";
	КонецЕсли;

	ВремяПараметрикаИтого 	= 0;
	ВремяЗаполненияИтого	= 0;
	ВремяЗаписиИтого		= 0;	
	ВремяЦелевоеИтого 		= 0;
	ВремяРазницаИтого 		= 0;
	ВремяОбщееИтого			= 0;
	
	КартинкаОК 				= БиблиотекаКартинок.ЗеленаяГалка;
	КартинкаНеОК 			= БиблиотекаКартинок.КрасныйКрест;
	
	БылиОшибки 				= Ложь;
	ОбработкаСравнения 		= Обработки.СравнениеТабличныхДокументов.Создать();
	
	// Вывод шапки
	ТабДокПротокол.Вывести(тМакет.ПолучитьОбласть("Область_Шапка|Область_Вер1" + ПрефиксОбласти));
	ТабДокПротокол.Присоединить(тМакет.ПолучитьОбласть("Область_Шапка|Область_Вер2" + ПрефиксОбласти)); 
	
	// Вывод строк
	Для Каждого Стр Из ТзРезультатВыполнения Цикл
		
		Область_СтрокаТеста1 = тМакет.ПолучитьОбласть("Область_СтрокаТеста|Область_Вер1" + ПрефиксОбласти);
		Область_СтрокаТеста2 = тМакет.ПолучитьОбласть("Область_СтрокаТеста|Область_Вер2" + ПрефиксОбласти);
		
		Область_СтрокаТеста2.Параметры.ВидОтчета		= Стр.ВидОтчета;
		Область_СтрокаТеста2.Параметры.ЭкземплярОтчета 	= Стр.ЭкземплярОтчета;
		Область_СтрокаТеста2.Параметры.ПравилоОбработки = Стр.ПравилоОбработки;	
				
		Если Стр.Результат Тогда
			
			Область_СтрокаТеста1.Область(1,2,1,2).Картинка 	= КартинкаОК;
			
			ВремяОбщее = Стр.ВремяРасчетаПараметрики + Стр.ВремяЗаполнения + Стр.ВремяЗаписи;
			
			// Сверяем с эталоном
			Если Стр.МакетЭталон <> Неопределено Тогда
				
				РезультатПроверкиМакетов = ОбработкаСравнения.СравнитьДваТабличныхДокумента(Стр.МакетЭталон, Стр.Макет);
				Стр.РезультатСравненияЭталон = РезультатПроверкиМакетов.ДокументыИдентичны;
				Если Стр.РезультатСравненияЭталон Тогда				
										
					Область_СтрокаТеста1.Область(1,3,1,3).Картинка 	= КартинкаОК;
					
					Область_СтрокаТеста2.Параметры.ВремяПараметрика = Стр.ВремяРасчетаПараметрики/1000;		
					ВремяПараметрикаИтого 							= ВремяПараметрикаИтого + Стр.ВремяРасчетаПараметрики;
					
					Область_СтрокаТеста2.Параметры.ВремяЗаполнения 	= Стр.ВремяЗаполнения/1000;
					ВремяЗаполненияИтого 							= ВремяЗаполненияИтого + Стр.ВремяЗаполнения;
					
					Область_СтрокаТеста2.Параметры.ВремяЗаписи 		= Стр.ВремяЗаписи/1000;
					ВремяЗаписиИтого 								= ВремяЗаписиИтого + Стр.ВремяЗаписи;
					
					Область_СтрокаТеста2.Параметры.ВремяОбщее 		= ВремяОбщее/1000;
					ВремяОбщееИтого = ВремяОбщееИтого + ВремяОбщее;
					
					Если Стр.ЦелевоеВремяЗаполнения > 0 Тогда
						
						Область_СтрокаТеста2.Параметры.ВремяЦелевое = Стр.ЦелевоеВремяЗаполнения/1000;
						ВремяЦелевоеИтого = ВремяЦелевоеИтого + Стр.ЦелевоеВремяЗаполнения;
						
						Область_СтрокаТеста2.Параметры.ВремяРазница = (Стр.ЦелевоеВремяЗаполнения - ВремяОбщее)/1000;
						ВремяРазницаИтого = ВремяРазницаИтого + (Стр.ЦелевоеВремяЗаполнения - ВремяОбщее);
						
					КонецЕсли;
					
				Иначе
					
					БылиОшибки = Истина;
					Ошибки = СтрСоединить(РезультатПроверкиМакетов.Ошибки, Символы.ПС);
					Область_СтрокаТеста1.Область(1,3,1,3).Картинка = КартинкаНеОК;
					Стр.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ошибка при сравнении макетов: %1'"), Ошибки);						
					
					ТабДокОтличияВМакетах.НачатьГруппуСтрок(Стр.ЭкземплярОтчета, Ложь);
					ТабДокОтличияВМакетах.Вывести(РезультатПроверкиМакетов.ДокументРезультат);
					ТабДокОтличияВМакетах.ЗакончитьГруппуСтрок();
					
				КонецЕсли;
				
			Иначе
				
				// Сверяем с классическим движком
				Если Стр.РезультатКлассическийДвижок Тогда
					
					ВремяОбщееКлассическийДвижок = Стр.ВремяРасчетаПараметрикиКлассическийДвижок + Стр.ВремяЗаполненияКлассическийДвижок + Стр.ВремяЗаписиКлассическийДвижок;
					
					РезультатПроверкиМакетов = ОбработкаСравнения.СравнитьДваТабличныхДокумента(Стр.МакетКлассическийДвижок, Стр.Макет);
					Стр.РезультатСравненияКлассическийДвижок = РезультатПроверкиМакетов.ДокументыИдентичны;						
					Если Стр.РезультатСравненияКлассическийДвижок Тогда					
						
						Область_СтрокаТеста1.Область(1,4,1,4).Картинка = КартинкаОК;
						
						Область_СтрокаТеста2.Параметры.ВремяПараметрика = Стр.ВремяРасчетаПараметрики/1000;		
						ВремяПараметрикаИтого 							= ВремяПараметрикаИтого + Стр.ВремяРасчетаПараметрики;
						
						Область_СтрокаТеста2.Параметры.ВремяЗаполнения 	= Стр.ВремяЗаполнения/1000;
						ВремяЗаполненияИтого 							= ВремяЗаполненияИтого + Стр.ВремяЗаполнения;
						
						Область_СтрокаТеста2.Параметры.ВремяЗаписи 		= Стр.ВремяЗаписи/1000;
						ВремяЗаписиИтого 								= ВремяЗаписиИтого + Стр.ВремяЗаписи; 
						
						Область_СтрокаТеста2.Параметры.ВремяОбщее 		= ВремяОбщее/1000;
						ВремяОбщееИтого 								= ВремяОбщееИтого + ВремяОбщее;
						
						Область_СтрокаТеста2.Параметры.ВремяПараметрикаКлассическийДвижок = Стр.ВремяРасчетаПараметрикиКлассическийДвижок/1000;		
						ВремяПараметрикаКлассическийДвижокИтого = ВремяПараметрикаКлассическийДвижокИтого + Стр.ВремяРасчетаПараметрикиКлассическийДвижок;
						
						Область_СтрокаТеста2.Параметры.ВремяЗаполненияКлассическийДвижок = Стр.ВремяЗаполненияКлассическийДвижок/1000;
						ВремяЗаполненияКлассическийДвижокИтого = ВремяЗаполненияКлассическийДвижокИтого + Стр.ВремяЗаполненияКлассическийДвижок;
						
						Область_СтрокаТеста2.Параметры.ВремяЗаписиКлассическийДвижок = Стр.ВремяЗаписиКлассическийДвижок/1000;
						ВремяЗаписиКлассическийДвижокИтого = ВремяЗаписиКлассическийДвижокИтого + Стр.ВремяЗаписиКлассическийДвижок;
						
						Область_СтрокаТеста2.Параметры.ВремяОбщееКлассическийДвижок = ВремяОбщееКлассическийДвижок/1000;						
						ВремяОбщееКлассическийДвижокИтого = ВремяОбщееКлассическийДвижокИтого + ВремяОбщееКлассическийДвижок;
						
						ВремяОбщееРасширенныйДвижокИтого = ВремяОбщееРасширенныйДвижокИтого + ВремяОбщее;
									
						Если ВремяОбщееКлассическийДвижок = 0 Тогда
							Область_СтрокаТеста2.Параметры.ДельтаАБС = 0;
							Область_СтрокаТеста2.Параметры.ДельтаОТН = 0;
						Иначе
							ДельтаАБС = (ВремяОбщееКлассическийДвижок - ВремяОбщее)/1000;
							Область_СтрокаТеста2.Параметры.ДельтаАБС = ДельтаАБС;
							Если ВремяОбщее = 0 Тогда
								Область_СтрокаТеста2.Параметры.ДельтаОТН = 0;
							ИначеЕсли ДельтаАБС < 0 Тогда
								Область_СтрокаТеста2.Параметры.ДельтаОТН = -1 * ВремяОбщееКлассическийДвижок / ВремяОбщее;
							Иначе
								Область_СтрокаТеста2.Параметры.ДельтаОТН = ВремяОбщееКлассическийДвижок / ВремяОбщее;
							КонецЕсли;
						КонецЕсли;
						
					Иначе
						
						Если Стр.РезультатСравненияЭталон = Неопределено Тогда
							БылиОшибки = Истина;
						КонецЕсли;
						Ошибки = СтрСоединить(РезультатПроверкиМакетов.Ошибки, Символы.ПС);
						
						Область_СтрокаТеста1.Область(1,4,1,4).Картинка = КартинкаНеОК;
						Стр.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ошибка при сравнении макетов: %1'"), Ошибки);
						
						ТабДокОтличияВМакетах.НачатьГруппуСтрок(Стр.ЭкземплярОтчета, Ложь);
						ТабДокОтличияВМакетах.Вывести(РезультатПроверкиМакетов.ДокументРезультат);
						ТабДокОтличияВМакетах.ЗакончитьГруппуСтрок();
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			БылиОшибки = Истина;
			Область_СтрокаТеста1.Область(1,2,1,2).Картинка = КартинкаНеОК;			
		КонецЕсли;
		
		ТабДокПротокол.Вывести(Область_СтрокаТеста1);
		ТабДокПротокол.Присоединить(Область_СтрокаТеста2);
		Если НЕ ПустаяСтрока(Стр.ОписаниеОшибки) Тогда			
			ТабДокПротокол.НачатьГруппуСтрок(,Ложь);
			Область_СтрокаОшибки = тМакет.ПолучитьОбласть("Область_СтрокаОшибки|Область_Вер1" + ПрефиксОбласти);
			ТабДокПротокол.Вывести(Область_СтрокаОшибки);
			Область_СтрокаОшибки = тМакет.ПолучитьОбласть("Область_СтрокаОшибки|Область_Вер2" + ПрефиксОбласти);
			Область_СтрокаОшибки.Параметры.ОписаниеОшибки = Лев(Стр.ОписаниеОшибки, 32000);
			ТабДокПротокол.Присоединить(Область_СтрокаОшибки);
			ТабДокПротокол.ЗакончитьГруппуСтрок();
		КонецЕсли;	
		
	КонецЦикла;
	
	// Выводим подвал
	Область_СтрокаТеста = тМакет.ПолучитьОбласть("Область_Итог|Область_Вер1" + ПрефиксОбласти);
	ТабДокПротокол.Вывести(Область_СтрокаТеста);
	Область_СтрокаТеста = тМакет.ПолучитьОбласть("Область_Итог|Область_Вер2" + ПрефиксОбласти);
	Область_СтрокаТеста.Параметры.ВремяПараметрикаИтого = ВремяПараметрикаИтого/1000;
	Область_СтрокаТеста.Параметры.ВремяЗаполненияИтого 	= ВремяЗаполненияИтого/1000;
	Область_СтрокаТеста.Параметры.ВремяЗаписиИтого 		= ВремяЗаписиИтого/1000;
	Область_СтрокаТеста.Параметры.ВремяОбщееИтого 		= ВремяОбщееИтого/1000;
	
	Область_СтрокаТеста.Параметры.ВремяЦелевоеИтого 	= ВремяЦелевоеИтого/1000;
	Область_СтрокаТеста.Параметры.ВремяРазницаИтого 	= ВремяРазницаИтого/1000;	
	
	// Области сравнения с классическим движком
	Если СравнениеСКлассическимАлгоритмомРасчета Тогда
		
		Область_СтрокаТеста.Параметры.ВремяПараметрикаКлассическийДвижокИтого 	= ВремяПараметрикаКлассическийДвижокИтого/1000;
		Область_СтрокаТеста.Параметры.ВремяЗаполненияКлассическийДвижокИтого 	= ВремяЗаполненияКлассическийДвижокИтого/1000;
		Область_СтрокаТеста.Параметры.ВремяЗаписиКлассическийДвижокИтого 		= ВремяЗаписиКлассическийДвижокИтого/1000;
		Область_СтрокаТеста.Параметры.ВремяОбщееКлассическийДвижокИтого 		= ВремяОбщееКлассическийДвижокИтого/1000;
		
		Если ВремяОбщееКлассическийДвижокИтого = 0 Тогда
			Область_СтрокаТеста.Параметры.ДельтаАБС = "";
			Область_СтрокаТеста.Параметры.ДельтаОТН = "";
		Иначе
			ДельтаАБС = (ВремяОбщееКлассическийДвижокИтого - ВремяОбщееРасширенныйДвижокИтого)/1000;
			Область_СтрокаТеста.Параметры.ДельтаАБС = ДельтаАБС;
			Если ВремяОбщееРасширенныйДвижокИтого = 0 Тогда
				Область_СтрокаТеста.Параметры.ДельтаОТН = "";
			ИначеЕсли ДельтаАБС < 0 Тогда
				Область_СтрокаТеста.Параметры.ДельтаОТН = -1 * ВремяОбщееКлассическийДвижокИтого / ВремяОбщееРасширенныйДвижокИтого;
			Иначе
				Область_СтрокаТеста.Параметры.ДельтаОТН = ВремяОбщееКлассическийДвижокИтого / ВремяОбщееРасширенныйДвижокИтого;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТабДокПротокол.Присоединить(Область_СтрокаТеста);
	ТабДокПротокол.ФиксацияСверху = 4;

	СтруктураРезультат.Вставить("БылиОшибки",БылиОшибки);
	Если ТабДокОтличияВМакетах.ВысотаТаблицы > 0 Тогда
		СтруктураРезультат.Вставить("ОтличияВМакетах",ТабДокОтличияВМакетах);		
	КонецЕсли;
	СтруктураРезультат.Вставить("Протокол",ТабДокПротокол);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
